Revit 2024 API
FabricSheetType.IsCustom Method
 Verifies if the type is Custom Fabric Sheet
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public bool IsCustom()
Visual Basic
Public Function IsCustom As Boolean
Visual C++
public:
bool IsCustom()
Return Value
 True if Layout is set on Custom and if the wireArr is not null
See Also
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace